{
  "version": "v0.1.7.9",
  "versionName": "NOTE: If you're on v0.1.7.6 or earlier, do not use the auto updater. Download the zip from the GitHub release page.\n\n* Asset Data Editor: new editor window for Model assets which allows accessing, creating and editing the Pipe Info, Level of Detail, Collision Model and Shadow Model entries for the model directly on the editor window.\n  * Also has checkbox which will cause some templates to use the selected model by default.\n* Asset Data Editor: all asset references now have a shortcut (the [...] box) for opening the Asset Data Editor directly without having to find it in the asset list.\n* Asset Data Editor: new buttons 'Copy Transformation' which copies the position, rotation and scale of the asset to clipboard and 'Paste Transformation' which pastes them.\n* Asset Data Editor: fixes not being able to add Animation States and Animation Effects to Animation Table assets.\n* Archive Editor: adds Organize Layers (semi-legacy). This function will rebuild the layer setup and create only one Texture, Model and BSP layer instead of three of each.\n* Sounds: the Asset Data Editor now allows playing sounds from all games on all platforms. Requires redownloading vgmstream (Tools -> Download vgmstream).\n* Improved editor for Movie/Incredibles GameCube Sound Info. Doesn't break cutscene audio anymore; properly preserves when copying/pasting/importing and allows editing of loop/stream flags.\n* New templates: floating blocks.\n* Fixes the Incredibles/ROTU SoundInfo on PS2.\n* Fixes issue in which placing or renaming Script assets with zero Timed Links would break IP.\n* Fixes issue in which importing a HIP from a different game (such as BFBB into Movie) would place assets into layers of incorrect types.\n* Fixes issue in which broken textures or textures with names longer than 32 characters could break IP and leave the file unable to be edited.\n* Fixes issue in which renaming an asset whose ID was previously 0 with 'Update References on Rename/Copy/Paste' on would cause every field in every asset to point to the renamed asset."
}
