{
  "version": "v0.1.7.7",
  "versionName": "NOTE: many of the new or updated features on this release are currently experimental. No Layers has not been tested thoroughly (specially on custom level files) and Apply Scale and Bake Scale are not guaranteed to work properly on every game, platform, level or asset (I unfortunately do not have time to test all possible use cases of the features myself). Make sure you backup your files often, and if you encounter a problem, please report it in the #tool-discussion channel of the Heavy Iron Modding Discord server and I'll look into it as soon as possible. Helpful feeback is always helpful. ~igorseabra4\n\nFor the full changelog, please check the release on GitHub (it doesn't fit here :x)\n\n* No Layers: Toggle from Archive Editor -> Edit -> Layers -> No Layers. This will convert the HIP/HOP archive into a format in which layers are virtually gone.\n* Organize Layers: from Archive Editor -> Edit -> Layers -> Organize, only if 'No Layers' is off. This function will erase your current layer setup and build a new one.\n* Bake Scale: this is available from the Asset Data Editors for entity assets. Click on the 'Click here' button below the scale values to bake the scaling of the asset if it's not (1, 1, 1). This creates a copy of the Model or Model Info with the scale applied.\n* Apply Scale: from Archive Editor -> Edit -> Apply Scale. This function applies a scale to the entire level and was updated to allow scaling of every asset type. You can also use Apply Scale on a single Model asset from its Asset Data Editor.\n* Apply Vertex Colors: from the Asset Data Editor for Model, you can choose a color and an operation to apply to the model's vertex colors.\n* 'VIL' assets (used only in BFBB and Incredibles) are now named 'NPC'; 'NPC' assets (used only in Scooby) are now named 'Villain'.\n* Drop assets: press H on the main view window to drop the selected assets. They will fall and land on whatever's below them.\n* Material Effects Editor: now allows selecting and editing properties (mesh color and texture name) for multiple materials at the same time.\n* Replace References on Copy/Paste: this function (toggle from Options) was extended to Replace References on Rename/Copy/Paste."
}
