{
  "version": "v0.1.5.2",
  "versionName": "# Industrial Park\n* Clicking on a HIP/HOP name from the Archive Editor tool strip menu will both open and maximize the Archive Editor window.\n* View Controls (under Options): see all keyboard and mouse controls.\n* Replace Assets on Paste (under Options): with this checked, pasted assets will replace existing ones instead of being renamed.\n* VSync (under Display): uncheck this option to disable the framerate limiter.\n* Lower Quality Graphics (under Display): check this option to use 16 bit depth and stencil buffers and disable anti-aliasing, depth clip and anisotropic filtering.\n* Slightly improved renderer.\n* Fixes closing program with empty Archive Editor window open.\n# Archive Editor\n* Multi Edit: allows opening one single Asset Data Editor window with multiple assets in it.\n  * Any edited properties will be applied to all assets.\n  * You can use this tool with assets of different types, but only properties common to all assets will be shown.\n  * You cannot edit Links with this tool.\n  * It's not recommended to use this on assets such as models, textures and sounds.\n* Export Audio (under Edit): choose a folder to export all SND/SNDS assets in the archive (with their headers).\n* Fixes deleting a non-empty layer (all assets will be deleted).\n# Asset Data Editors\n* Asset Data Editor windows are now named according to their asset.\n* COND editor: adds Conditional variable names (TSSM), thanks Seil for the information.\n* DEST editor: now exists; thanks MinecraftFreak73 for the information.\n* PLAT editor: fixes editing Breakaway Platform (TSSM).\n* RWTX editor: attempts to fix issues with certain textures with transparency (still WIP); thanks JoeyBallentine for the work on this.\n* SURF editor: allows editing Links (TSSM).\n# Link List Editor\n* Allows editing multiple links at the same time by selecting multiple on the list (with Shift, Ctrl or click + drag).\n# Import Models\n* Allows choosing solidity of generated SIMPs.\n# Templates\n* New Templates (TSSM Stage Items):\n  * Checkpoint\n  * Checkpoint_Invisible\n  * CollapsePlatform_Planktopolis\n  * CollapsePlatform_Spongeball\n  * CollapsePlatform_ThugTug\n* New Templates (Other):\n  * EmptySND\n  * EmptySNDS\n# Randomizer\n* Removed some unused portals from TSSM levels."
}
