{
  "version": "v0.1.7.7",
  "versionName": "NOTE: many of the new or updated features on this release are currently experimental. No Layers has not been tested thoroughly (specially on custom level files) and Apply Scale and Bake Scale are not guaranteed to work properly on every game, platform, level or asset (I unfortunately do not have time to test all possible use cases of the features myself). Make sure you backup your files often, and if you encounter a problem, please report it in the #tool-discussion channel of the Heavy Iron Modding Discord server and I'll look into it as soon as possible. Helpful feeback is always helpful. ~igorseabra4\n\n* No Layers: Toggle from Archive Editor -> Edit -> Layers -> No Layers. This will convert the HIP/HOP archive into a format in which layers are virtually gone: you cannot edit the layer setup anymore and assets will be placed automatically by Industrial Park in the correct layers upon saving; you do not have to worry about them anymore. Enabling this will erase your current layer setup.\n* Organize Layers: from Archive Editor -> Edit -> Layers -> Organize, only if 'No Layers' is off. This function will erase your current layer setup and build a new one, the same setup used by 'No Layers' when saving. It's basically the same as 'No Layers', but you still have control over the layer setup afterwards.\n* Bake Scale: this is available from the Asset Data Editors for entity assets. Click on the 'Click here' button below the scale values to bake the scaling of the asset if it's not (1, 1, 1). This creates a copy of the Model or Model Info with the scale applied and sets the entity asset's scale to (1, 1, 1). This allows scaling of assets such as NPCs and enemies, as well as scaling models differently on each axis, without creating collision glitches. If the asset's previous Model or Model Info goes unused after this, it won't be deleted, so I recommend deleting it to save on the file size.\n* Apply Scale: from Archive Editor -> Edit -> Apply Scale. This function applies a scale to the entire level and was updated to allow scaling of every asset type (including GameCube native data and BFBB JSP models) and allow you to choose which asset types to scale, as well as checkboxes for:\n  * Bake unproportional scales on entity assets: will apply the Bake Scale function into assets if the scale axes are unproportional, which will prevent collision glitches. To avoid increasing your file size significantly, if you're not going to use them anymore, you should delete the previous (unscaled) models, which will be left unused.\n  * Apply and bake scale to NPCs: will apply the Bake Scale function into NPC and Villain assets, which allows them to be properly scaled. If left unchecked, their scale will be left unchanged.\nYou can also use Apply Scale on a single Model asset from its Asset Data Editor.\n* Apply Vertex Colors: from the Asset Data Editor for Model, you can choose a color and an operation to apply to the model's vertex colors. Updated to support GameCube JSPs and other native data models.\n* 'VIL' assets (used only in BFBB and Incredibles) are now named 'NPC'; 'NPC' assets (used only in Scooby) are now named 'Villain'. This only applies if 'Use Legacy Asset Type Format' from Options is off; if it's on, the assets will still be named 'VIL' and 'NPC' respectively.\n* Drop assets: press H on the main view window to drop the selected assets. They will fall and land on whatever's below them.\n* Material Effects Editor: now allows selecting and editing properties (mesh color and texture name) for multiple materials at the same time.\n* Replace References on Copy/Paste: this function (toggle from Options) was extended to Replace References on Rename/Copy/Paste. Renaming an asset with this on will also replace previous references of it to the new name.\n* Model Info scales are now considered by the renderer.\n* Improved 'Verify Archive'.\n* New or updated editors for asset types: Attack Table, Audio Conversation (ROTU), Checkpoint (ROTU), Credits, Grass, Model Info, Pickup Types, Rubble Generator, Script (ROTU), Shrapnel, Smoke Emitter, Talk Box, Text Box, Zip Line.\n* New templates: Rubble Generator, Zip Line.\n* Allows choosing game version for Flame Emitter, Scene Properties, Script and UI Image (usually, asset formats are the same in Movie, Incredibles and ROTU, but not for these assets; when editing, make sure you select the version for the game you're working on).\n* Allows changing asset type on Asset Header Editor (only between Texture <=> Texture Stream or Simple Object <=> Track).\n* Faster loading and saving of HIP/HOP archives.\n* Added Ratatouille Prototype DYNA asset names.\n* Help button on DYNA assets now leads to the actual asset type page on the wiki instead of the DYNA page (thanks Suprnova).\n* Proper exporting of textures with 4444 raster format (thanks Joey).\n* Updates and fixes issue on Discord Rich Presence (thanks Suprnova).\n* Adds British English localization (thanks Pepperpot).\n* Fixes non-.RW3 textures exporting with no name on the TXD file (thanks Seil).\n* Randomizer\n  * New method: Vertex Colors. Randomizes vertex colors of models.\n  * New method: Set Scale. Allows using the Apply Scale function on the entire game at once."
}
