{
  "version": "v0.1.3",
  "versionName": "\nv0.1.3\n\n* Edit PACK is now named Convert Archive.\n* * Archive Convertion Helper: when converting an archive between GameCube/Xbox formats, Industrial Park will convert the formats of the assets it is able to. For the ones it cannot (such as sounds and MINF), it will ask you to choose a directory to replace the assets from; all HIP/HOPs in this directory and subdirectories will be scanned for the assets. Any assets which were not found will not be converted and the list will be shown at the end. Texture assets are not converted. This function is still experimental.\n* Flag Field editor: any assets with bit field values (such as button hit mask) now have specific editors for these entries. You can edit individual bits in a expandable entry in the asset data editor.\n* Material Effect Editor: tool available from the MODL Asset Data Editor. Allows you to create and edit not only texture names and material colors for individual materials in the model, but also create a Material Effects PLG RenderWare section with Bump Mapping, Environment Mapping and Dual Texture effects. Note that none of these effects are previewed in Industrial Park's view.\n* Adds Asset Editor: CSN (Cutscene). Doesn't really allow you to edit the asset yet, but you can extract all models (DFF) and animations (SKB1) contained in it.\n* Templates: Chain Point MVPTs. Available from Tools. When checked, each time you place a Point MVPT template (starting from the second one in the session!) the previous one's \"NextMVPTs\" will be updated to point to it.\n* Box Trigger gizmos properly rotate along with the box.\n* Adds confirmation on remove layer.\n* Automatically refresh textures and models on new texture/model import.\n* Ctrl + A to select all assets on list on Archive Editor.\n* Message boxes always appear on top of other windows.\n* Archives and program close faster.\n* Randomizer: adds logic not to break Texas hitches and other objects with Invisible Objects.\n"
}